---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.NonSupportedCurtainWall
source: html/e2ac28bf-79ee-4b86-161f-dc98413ad32e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.NonSupportedCurtainWall Property

Currently, only straight Walls with straight or arc edges are supported for non-rectangular Curtain Walls.

## Syntax (C#)
```csharp
public static FailureDefinitionId NonSupportedCurtainWall { get; }
```